1s/ERP/Conf/InformationRegisters/Лико_СрокиГодностиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_СрокиГодностиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГодностиАдминистративный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_СрокиГодностиНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция Контролировать(Площадка, Номенклатура, Дата ) Экспорт 
УстановитьПривилегированныйРежим(Истина);	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокГодности КАК СрокГодности
	|ИЗ
	|	РегистрСведений.Лико_СрокиГодностиНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Площадка = &Площадка
	|				И Номенклатура = &Номенклатура) КАК Лико_СрокиГодностиНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат = Выборка.СрокГодности;
	
	КонецЦикла; 
	
	
Возврат Результат;	

КонецФункции 

Функция СрокГодностиНоменклатуры(Площадка, Номенклатура, Дата ) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Соответствие;
	Результат.Вставить(Справочники.Номенклатура.ПустаяСсылка(),0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокГодности КАК СрокГодности,
	|	Лико_СрокиГодностиНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Лико_СрокиГодностиНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Площадка = &Площадка
	|				И Номенклатура В (&Номенклатура)) КАК Лико_СрокиГодностиНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат.Вставить(Выборка.Номенклатура,Выборка.СрокГодности);
	
	КонецЦикла; 
	
	
Возврат Результат;	

КонецФункции 


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
#КонецЕсли
